{
  "basic_info": {
    "description_header": "Hi",
    "description": "👋 Hi, ich bin Daniel Cermann ✴ {{AGE}} Jahre alt ✴ Softwareentwickler und Maker aus Deutschland. <br>Ich interessiere mich für alles von Webentwicklung bis hin zu spannenden Problemlösungen. <br>Aktuell studiere ich IT-Systemtechnik am Hasso-Plattner-Institut und arbeite außerdem als Werkstudent bei Engie, wo wir den Markt für grüne Energie modernisieren.",
    "section_name": {
      "home": "Home",
      "about": "Über mich",
      "projects": "Projekte",
      "skills": "Skills",
      "experience": "Erfahrungen",
      "contact": "Kontakt"
    }
  },
  "projects": [
    {
      "title": "BeeSupervisor",
      "description": "Varroamilben sind Parasiten, die sich an Honigbienen festsaugen und diese ähnlich wie Zecken schädigen. Jährlich sterben etwa 20% aller Bienenstöcke. Durch am Bienenstockeingang angebrachte Kameras werden hereinfliegende Bienen auf den Parasiten untersucht. Der Imker wird anschließend über den Befall eines Volkes informiert und kann die Bienen entsprechend behandeln."
    },
    {
      "title": "GYPT - German Young Physicist Tournament",
      "description": "Beim GYPT, German Young Physicists Tournament, 2021 habe ich eine physikalische Simulation geschrieben. Die erstellte Website diente der Veranschaulichung der praktischen Experimente, die ich außerdem durchgeführt habe."
    },
    {
      "title": "Convex Hulls",
      "description": "Im Rahmen eines Informatikprojekts habe ich eine Webapp programmiert, die die konvexe Hülle einer Punktmenge findet. Der Nutzer kann eine Punktmenge generieren lassen oder manuell eingeben. Mehrere Algorithmen, darunter Jarvis March, Graham Scan und Chan's Algorithm, werden dabei visualisiert."
    },
    {
      "title": "Mega-Tic-Tac-Toe",
      "description": "Coole Erweiterung von TicTacToe: In jedem der klassischen 3x3 Felder befindet sich ein TicTacToe-Feld, in denen jeweils ein separates Spiel abläuft 🤯"
    },
    {
      "title": "Mensch ärgere dich nicht - Simulation",
      "description": "Für die 4. Aufgabe des Bundeswettbewerbs Informatik 2021 habe ich eine Spielsimulation für Mensch ärgere dich nicht programmiert. Für jeden der vier Spieler können dabei Würfel mit beliebiger Seitenanzahl und beliebigen Augenzahlen erstellt werden. Durch mehrere Simulationen kann dadurch der beste Würfel ermittelt werden."
    }
  ],
  "skills": [
    {
      "name": "Sprachen, die ich spreche",
      "data": [
        { "name": "Deutsch",  "description": "Muttersprache..." },
        { "name": "Englisch", "description": "C2 Level beim ,,Certificate of Advanced English'' (CAE)" },
        { "name": "Spanisch", "description": "Habe ich ein Jahr lang beim Freiwilligendienst in Argentinien gelernt" }
      ]
    },
    {
      "name": "Programmiersprachen",
      "data": [
        { "name": "Python",     "description": "" },
        { "name": "TypeScript", "description": "" },
        { "name": "Golang",     "description": "" },
        { "name": "C++",        "description": "" },
        { "name": "PHP",        "description": "" },
        { "name": "Java",       "description": "" },
        { "name": "HTML/CSS/JS","description": "" }
      ]
    },
    {
      "name": "Frameworks und Bibliotheken",
      "data": [
        { "name": "React",       "description": "" },
        { "name": "Tailwind CSS","description": "" },
        { "name": "THREE JS",    "description": "" }
      ]
    },
    {
      "name": "Nützliche Tools und Grundlagen",
      "data": [
        { "name": "vim/neovim", "description": "" },
        { "name": "LaTeX",      "description": "" },
        { "name": "3D-Design",  "description": "mit Fusion 360" },
        { "name": "bash",       "description": "" },
        { "name": "git",        "description": "" }
      ]
    },
    {
      "name": "Dinge, die ich lernen möchte",
      "data": [
        { "name": "Svelte",                 "description": "Es ist sooo cool" },
        { "name": "Rust",                   "description": "Klingt seeehr cool" },
        { "name": "Test Driven Development","description": "" },
        { "name": "Cyber Security",         "description": "Nur Whitehat-Hacking 😉" }
      ]
    }
  ],
  "experience": [
    {
      "title": "Nebenjob bei LogoData Erfurt",
      "description": "Ich habe einige Monate bei LogoData an einem internen Tool gearbeitet. Ich habe dort mit einem Ferienjob begonnen und später im Home-Office parallel zum Abitur weitergearbeitet. Ich hatte einen super netten Chef und coole Kollegen und habe meine Zeit mit LogoData sehr genossen :)"
    },
    {
      "title": "Freiwilligenjahr - Argentinien 🇦🇷",
      "description": "Nach der Schule habe ich ein Jahr in einem Jugendprojekt in der Nähe von Buenos Aires verbracht. Im ''Refugio San Eugenio'' habe ich mich vielen Herausforderungen, besonders im Bezug auf soziale Probleme, gestellt und viele Menschen ins Herz geschlossen."
    },
    {
      "title": "ISEF",
      "description": "Im Mai 2023 bin ich mit zwei guten Freunden nach Dallas geflogen, um Deutschland auf der ISEF (International Science and Engineering Fair) mit unserem Projekt ,,BeeSupervisor'' zu vertreten. Dort wurden wir mit einem 3. Platz Grand Award und zwei Sonderpreisen ausgezeichnet 🥳🎊🥂"
    },
    {
      "title": "Werkstudent @Engie",
      "description": "Bei Engie GEMS habe ich an zwei großen Projekten als Lead-Engineer gearbeitet: ein 7/7 Tool zur Strombuchung in internen Systemen, das täglich mehrere Gigawattstunden Strom bucht, und ein Tool zur automatisierten Generierung von PPA-Verträgen für unser Legal-Team."
    },
    {
      "title": "Bachelor @Hasso-Plattner-Institut",
      "description": "Ich studiere zur Zeit IT-Systems Engineering am Hasso-Plattner-Institut. Dabei lerne ich viele Grundlagen der Mathematik und theoretischen Informatik, gleichzeitig erlerne ich auch praktische Problemlösefähigkeiten."
    }
  ]
}
